In [1]:
import pandas as pd
import numpy as np

In [2]:
# import DataFrame

bank_df = pd.read_csv(r"C:\Users\Avniiii\Data_Analytics_class\datasets\bank_customer.csv")

In [3]:
bank_df.head()

,Customer ID,Name,Surname,Gender,Age,Region,Job Classification,Date Joined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79

In [4]:
bank_df.isnull().sum()

Customer ID           0
Name                  0
Surname               0
Gender                0
Age                   0
Region                0
Job Classification    0
Date Joined           0
Balance               0
dtype: int64

In [5]:
bank_df.shape

(4014, 9)

In [6]:
bank_df.describe()

        Customer ID          Age        Balance
count  4.014000e+03  4014.000000    4014.000000
mean   1.696831e+08    38.611111   39766.448274
std    8.865374e+07     9.819121   29859.489192
min    1.000000e+08    15.000000      11.520000
25%    1.000020e+08    31.000000   16115.367500
50%    1.000038e+08    37.000000   33567.330000
75%    2.000031e+08    45.000000   57533.930000
max    4.000038e+08    64.000000  183467.700000

In [7]:
bank_df.columns

Index(['Customer ID', 'Name', 'Surname', 'Gender', 'Age', 'Region',
       'Job Classification', 'Date Joined', 'Balance'],
      dtype='object')

In [8]:
# Get Customer Ids Who Have White Collor Job

bank_df.loc[bank_df['Job Classification']=='White Collar',['Customer ID']]

      Customer ID
0       100000001
2       100000003
3       300000004
8       300000009
9       100000010
...           ...
3999    300004000
4000    300004001
4001    300004002
4002    100004003
4004    100004005

[1955 rows x 1 columns]

In [9]:
# Full Name those 20 yr old customers

bank_df.loc[bank_df['Age']==20,['Name','Surname']]

          Name    Surname
81        Neil  Robertson
131      James   Marshall
339    Rebecca       Nash
466     Angela   Morrison
512        Amy    Wilkins
574    Michael   Davidson
737    Natalie     Tucker
1756   Cameron     Arnold
2197     Molly     Fisher
2233   Heather     Hughes
2313    Hannah       Hill
2481    Yvonne      Poole
2520  Penelope    Parsons
2781  Nicholas   Buckland
3369   Jessica      Lyman
3379    Victor    Cameron
3470     Wendy     Martin
3556      John  Mackenzie
3660     Keith       Reid
3892      Lisa      Terry

In [10]:
# Region Where Male customers are Dominating
gr1 = bank_df.groupby(by=['Region','Gender'])
gr1.count()

                         Customer ID  Name  Surname   Age  Job Classification  \
Region           Gender
England          Female         1091  1091     1091  1091                1091
                 Male           1068  1068     1068  1068                1068
Northern Ireland Female          157   157      157   157                 157
                 Male             54    54       54    54                  54
Scotland         Female          319   319      319   319                 319
                 Male            805   805      805   805                 805
Wales            Female          282   282      282   282                 282
                 Male            238   238      238   238                 238

                         Date Joined  Balance
Region           Gender
England          Female         1091     1091
                 Male           1068     1068
Northern Ireland Female          157      157
                 Male             54       54
Scotland         Female          319      319
                 Male            805      805
Wales            Female          282      282
                 Male            238      238

In [11]:
# Job Where Female customers are Dominating
gr1 = bank_df.groupby(by=['Job Classification','Gender'])
gr1.count()

                           Customer ID  Name  Surname   Age  Region  \
Job Classification Gender
Blue Collar        Female          255   255      255   255     255
                   Male            794   794      794   794     794
Other              Female          584   584      584   584     584
                   Male            426   426      426   426     426
White Collar       Female         1010  1010     1010  1010    1010
                   Male            945   945      945   945     945

                           Date Joined  Balance
Job Classification Gender
Blue Collar        Female          255      255
                   Male            794      794
Other              Female          584      584
                   Male            426      426
White Collar       Female         1010     1010
                   Male            945      945

In [63]:
# Maximum Age In the Region
eng = bank_df[bank_df['Region']=='England']
eng['Age'].max()

61

In [68]:
eng = bank_df[bank_df['Region']=='Northern Ireland']
eng['Age'].max()

61

In [69]:
eng = bank_df[bank_df['Region']=='Wales']
eng['Age'].max()

63

In [71]:
eng = bank_df[bank_df['Region']=='Scotland']
eng['Age'].max()

64

In [72]:
# Maximum Age In the Region
eng = bank_df[bank_df['Region']=='England']
eng['Age'].min()

18

In [73]:
eng = bank_df[bank_df['Region']=='Northern Ireland']
eng['Age'].min()

15

In [74]:
eng = bank_df[bank_df['Region']=='Wales']
eng['Age'].min()

18

In [75]:
eng = bank_df[bank_df['Region']=='Scotland']
eng['Age'].min()

18

In [77]:
# Maximum Age on the Basis of Gender

max_age_m = bank_df[bank_df['Gender']=='Female']
max_age_m['Age'].max()

64

In [79]:
# Maximum Age on the Basis of Gender

max_age_f = bank_df[bank_df['Gender']=='Male']
max_age_f['Age'].max()

64

In [80]:
# Minimum Age on the Basis of Gender

max_age_m = bank_df[bank_df['Gender']=='Female']
max_age_m['Age'].min()

15

In [81]:
# Minimum Age on the Basis of Gender

max_age_f = bank_df[bank_df['Gender']=='Male']
max_age_f['Age'].min()

17

In [84]:
# Maximum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='White Collar']
max_age_f['Age'].max()

61

In [85]:
# Maximum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='Blue Collar']
max_age_f['Age'].max()

64

In [86]:
# Maximum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='Other']
max_age_f['Age'].max()

64

In [87]:
# Minimum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='White Collar']
max_age_f['Age'].min()

15

In [88]:
# Minimum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='Blue Collar']
max_age_f['Age'].min()

17

In [89]:
# Minimum Age on the Basis of Job

max_age_f = bank_df[bank_df['Job Classification']=='Blue Collar']
max_age_f['Age'].min()

17

In [100]:
# Highest Balance Customer
bank_df.loc[bank_df['Balance'].max()==bank_df['Balance'],['Customer ID','Name']]

      Customer ID     Name
1306    100001307  Dorothy

In [101]:
# Lowest Balance Customer
bank_df.loc[bank_df['Balance'].min()==bank_df['Balance'],['Customer ID','Name']]

      Customer ID  Name
1319    100001320  Jane

In [105]:
# Lowest Balance Customer
bank_df.loc[bank_df['Job Classification']=='Blue Collar',['Region']]

                Region
1     Northern Ireland
4              England
5                Wales
6              England
18             England
...                ...
4006           England
4007           England
4010          Scotland
4012          Scotland
4013             Wales

[1049 rows x 1 columns]

In [108]:
eng_reg = bank_df[bank_df['Region']=='England']
eng_reg.loc[eng_reg['Balance'].max()==eng_reg['Balance'],['Region','Balance','Date Joined']]

       Region   Balance Date Joined
1306  England  183467.7   22.Jul.15

In [110]:
bank_df.loc[bank_df['Region']=='Wales',['Customer ID','Name']]

      Customer ID       Name
3       300000004     Trevor
5       300000006        Ava
8       300000009       Ruth
14      300000015  Madeleine
20      300000021      Boris
...           ...        ...
3982    300003983      Bella
3999    300004000   Benjamin
4000    300004001  Gabrielle
4001    300004002     Austin
4013    300004014    Stephen

[520 rows x 2 columns]

In [112]:
# Highest Balance on the basis ogf Gender
bal_f = bank_df.loc[bank_df['Gender']=='Female']
bal_f['Balance'].max()

183467.7

In [114]:
# Highest Balance on the basis ogf Gender
bal_m = bank_df.loc[bank_df['Gender']=='Male']
bal_m['Balance'].max()

181680.99

In [121]:
# How many customers have age less than 34 and have white collor job
age_white_collar = bank_df.loc[bank_df['Age']<34 ]
age_white_collar[age_white_collar['Job Classification']=='White Collar'].count()

Customer ID           818
Name                  818
Surname               818
Gender                818
Age                   818
Region                818
Job Classification    818
Date Joined           818
Balance               818
dtype: int64

In [123]:
# How many customers have age more than 46 and have white collor job
age_blue_collar = bank_df.loc[bank_df['Age']>46 ]
age_blue_collar[age_blue_collar['Job Classification']=='Blue Collar'].count()

Customer ID           368
Name                  368
Surname               368
Gender                368
Age                   368
Region                368
Job Classification    368
Date Joined           368
Balance               368
dtype: int64